package ru.gb.lesson3;

public class Homework {

  /**
   * Реализовать класс Сотрудник (Employee) c полями:
   * 1. Имя
   * 2. Возраст
   * 3. Зарплата
   * 4. Наименование департамента
   *
   * Необходимо:
   * 1. Создать список из разных сотрудников (штук 20)
   * 2. Отсортировать список по возрастанию возраста, по убыванию зарплаты, и по наименованию отдела (в лексикографическом порядке) (вывести на консоль).
   * Подумать о том, какую сортирвку сделать по умолчанию (заложить в класс, интерфейс Comparable), а какие две сделать внешними (интерфейс Comparator).
   */

}
